import numpy as np

# Теоретическая матрица распределения двумерной ДСВ
theoretical_probabilities = np.array([
    [0.01, 0.01, 0.02, 0.02, 0.01],  # X ->
    [0.04, 0.3, 0.06, 0.03, 0.01],
    [0.02, 0.03, 0.06, 0.07, 0.05],
    [0.05, 0.03, 0.04, 0.02, 0.03],
    [0.03, 0.02, 0.01, 0.01, 0.02]
])
# Y
# |
# V

# Эмпирическая матрица распределения двумерной ДСВ
empirical_probabilities = np.zeros_like(theoretical_probabilities)

# Вектора возможных значений
theoretical_X = np.array([1, 2, 3, 4, 5])
theoretical_Y = np.array([6, 7, 8, 9, 10])

# Эмпирические значения состовляющих векторов
empirical_X_values = list()
empirical_Y_values = list()

# Количество генерируемых значений
COUNT = 100000

# Критерий Мизеса для уровня значимости 0.05
THEORETICAL_MISES = 0.461

# Квантили из таблицы значений функции Лапласа
quantiles = {
    "90": 1.64,
    "92": 1.75,
    "95": 1.96,
    "97": 2.17,
    "99": 2.54,
}

